In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data_cleaning_sample.csv")

In [3]:
df

      Name   Age        City  Gender             Email   Join Date
0   Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023
1    Rahul   NaN      Mumbai    Male   rahul@yahoo.com  10-02-2023
2    Sneha  22.0         NaN  Female   sneha@gmail.com  05-03-2023
3    Rohit  30.0   Hyderabad     NaN   rohit@gmail.com  28-02-2023
4     Amit  28.0   Bangalore    Male    amit@gmail.com         NaN
5     Neha   NaN       Delhi  Female    neha@yahoo.com  12-04-2023
6    Rohit  30.0   Hyderabad     NaN   rohit@gmail.com  28-02-2023
7    Kiran  27.0         NaN    Male               NaN  18-03-2023
8   Simran  23.0  Chandigarh  Female  simran@gmail.com         NaN
9    Vikas   NaN      Jaipur    Male   vikas@yahoo.com  01-05-2023
10  Anjali  26.0      Indore  Female               NaN  20-04-2023
11  Suresh  35.0         NaN    Male  suresh@gmail.com  08-01-2023
12   Meena   NaN      Bhopal  Female   meena@yahoo.com         NaN
13   Arjun  29.0     Chennai     NaN               NaN  14-02-2023
14   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
15   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
16  Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023

In [4]:
df.isnull()

     Name    Age   City  Gender  Email  Join Date
0   False  False  False   False  False      False
1   False   True  False   False  False      False
2   False  False   True   False  False      False
3   False  False  False    True  False      False
4   False  False  False   False  False       True
5   False   True  False   False  False      False
6   False  False  False    True  False      False
7   False  False   True   False   True      False
8   False  False  False   False  False       True
9   False   True  False   False  False      False
10  False  False  False   False   True      False
11  False  False   True   False  False      False
12  False   True  False   False  False       True
13  False  False  False    True   True      False
14  False  False  False   False  False      False
15  False  False  False   False  False      False
16  False  False  False   False  False      False

In [5]:
df.isnull().sum()

Name         0
Age          4
City         3
Gender       3
Email        3
Join Date    3
dtype: int64

In [6]:
df.dropna()

      Name   Age   City  Gender             Email   Join Date
0   Aditya  24.0  Delhi    Male  aditya@gmail.com  15-01-2023
14   Kavya  21.0  Kochi  Female   kavya@gmail.com  30-03-2023
15   Kavya  21.0  Kochi  Female   kavya@gmail.com  30-03-2023
16  Aditya  24.0  Delhi    Male  aditya@gmail.com  15-01-2023

In [7]:
df.dropna(axis=1)

      Name
0   Aditya
1    Rahul
2    Sneha
3    Rohit
4     Amit
5     Neha
6    Rohit
7    Kiran
8   Simran
9    Vikas
10  Anjali
11  Suresh
12   Meena
13   Arjun
14   Kavya
15   Kavya
16  Aditya

In [8]:
df.fillna(0)

      Name   Age        City  Gender             Email   Join Date
0   Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023
1    Rahul   0.0      Mumbai    Male   rahul@yahoo.com  10-02-2023
2    Sneha  22.0           0  Female   sneha@gmail.com  05-03-2023
3    Rohit  30.0   Hyderabad       0   rohit@gmail.com  28-02-2023
4     Amit  28.0   Bangalore    Male    amit@gmail.com           0
5     Neha   0.0       Delhi  Female    neha@yahoo.com  12-04-2023
6    Rohit  30.0   Hyderabad       0   rohit@gmail.com  28-02-2023
7    Kiran  27.0           0    Male                 0  18-03-2023
8   Simran  23.0  Chandigarh  Female  simran@gmail.com           0
9    Vikas   0.0      Jaipur    Male   vikas@yahoo.com  01-05-2023
10  Anjali  26.0      Indore  Female                 0  20-04-2023
11  Suresh  35.0           0    Male  suresh@gmail.com  08-01-2023
12   Meena   0.0      Bhopal  Female   meena@yahoo.com           0
13   Arjun  29.0     Chennai       0                 0  14-02-2023
14   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
15   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
16  Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023

In [9]:
df["Age"].fillna(df["Age"].mean())

0     24.000000
1     26.153846
2     22.000000
3     30.000000
4     28.000000
5     26.153846
6     30.000000
7     27.000000
8     23.000000
9     26.153846
10    26.000000
11    35.000000
12    26.153846
13    29.000000
14    21.000000
15    21.000000
16    24.000000
Name: Age, dtype: float64

In [10]:
df.ffill()

      Name   Age        City  Gender             Email   Join Date
0   Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023
1    Rahul  24.0      Mumbai    Male   rahul@yahoo.com  10-02-2023
2    Sneha  22.0      Mumbai  Female   sneha@gmail.com  05-03-2023
3    Rohit  30.0   Hyderabad  Female   rohit@gmail.com  28-02-2023
4     Amit  28.0   Bangalore    Male    amit@gmail.com  28-02-2023
5     Neha  28.0       Delhi  Female    neha@yahoo.com  12-04-2023
6    Rohit  30.0   Hyderabad  Female   rohit@gmail.com  28-02-2023
7    Kiran  27.0   Hyderabad    Male   rohit@gmail.com  18-03-2023
8   Simran  23.0  Chandigarh  Female  simran@gmail.com  18-03-2023
9    Vikas  23.0      Jaipur    Male   vikas@yahoo.com  01-05-2023
10  Anjali  26.0      Indore  Female   vikas@yahoo.com  20-04-2023
11  Suresh  35.0      Indore    Male  suresh@gmail.com  08-01-2023
12   Meena  35.0      Bhopal  Female   meena@yahoo.com  08-01-2023
13   Arjun  29.0     Chennai  Female   meena@yahoo.com  14-02-2023
14   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
15   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
16  Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023

In [11]:
df.bfill()

      Name   Age        City  Gender             Email   Join Date
0   Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023
1    Rahul  22.0      Mumbai    Male   rahul@yahoo.com  10-02-2023
2    Sneha  22.0   Hyderabad  Female   sneha@gmail.com  05-03-2023
3    Rohit  30.0   Hyderabad    Male   rohit@gmail.com  28-02-2023
4     Amit  28.0   Bangalore    Male    amit@gmail.com  12-04-2023
5     Neha  30.0       Delhi  Female    neha@yahoo.com  12-04-2023
6    Rohit  30.0   Hyderabad    Male   rohit@gmail.com  28-02-2023
7    Kiran  27.0  Chandigarh    Male  simran@gmail.com  18-03-2023
8   Simran  23.0  Chandigarh  Female  simran@gmail.com  01-05-2023
9    Vikas  26.0      Jaipur    Male   vikas@yahoo.com  01-05-2023
10  Anjali  26.0      Indore  Female  suresh@gmail.com  20-04-2023
11  Suresh  35.0      Bhopal    Male  suresh@gmail.com  08-01-2023
12   Meena  29.0      Bhopal  Female   meena@yahoo.com  14-02-2023
13   Arjun  29.0     Chennai  Female   kavya@gmail.com  14-02-2023
14   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
15   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023
16  Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023

In [12]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15     True
16     True
dtype: bool

In [13]:
df.drop_duplicates()

      Name   Age        City  Gender             Email   Join Date
0   Aditya  24.0       Delhi    Male  aditya@gmail.com  15-01-2023
1    Rahul   NaN      Mumbai    Male   rahul@yahoo.com  10-02-2023
2    Sneha  22.0         NaN  Female   sneha@gmail.com  05-03-2023
3    Rohit  30.0   Hyderabad     NaN   rohit@gmail.com  28-02-2023
4     Amit  28.0   Bangalore    Male    amit@gmail.com         NaN
5     Neha   NaN       Delhi  Female    neha@yahoo.com  12-04-2023
7    Kiran  27.0         NaN    Male               NaN  18-03-2023
8   Simran  23.0  Chandigarh  Female  simran@gmail.com         NaN
9    Vikas   NaN      Jaipur    Male   vikas@yahoo.com  01-05-2023
10  Anjali  26.0      Indore  Female               NaN  20-04-2023
11  Suresh  35.0         NaN    Male  suresh@gmail.com  08-01-2023
12   Meena   NaN      Bhopal  Female   meena@yahoo.com         NaN
13   Arjun  29.0     Chennai     NaN               NaN  14-02-2023
14   Kavya  21.0       Kochi  Female   kavya@gmail.com  30-03-2023

In [14]:
df["City"].str.contains("delhi", case=False)

0      True
1     False
2       NaN
3     False
4     False
5      True
6     False
7       NaN
8     False
9     False
10    False
11      NaN
12    False
13    False
14    False
15    False
16     True
Name: City, dtype: object

In [15]:
df["Email"].str.split("@")

0     [aditya, gmail.com]
1      [rahul, yahoo.com]
2      [sneha, gmail.com]
3      [rohit, gmail.com]
4       [amit, gmail.com]
5       [neha, yahoo.com]
6      [rohit, gmail.com]
7                     NaN
8     [simran, gmail.com]
9      [vikas, yahoo.com]
10                    NaN
11    [suresh, gmail.com]
12     [meena, yahoo.com]
13                    NaN
14     [kavya, gmail.com]
15     [kavya, gmail.com]
16    [aditya, gmail.com]
Name: Email, dtype: object

In [16]:
df2 = df.dropna().copy()

In [17]:
df2["Age"] = df2["Age"].astype(int)

In [18]:
df2

      Name  Age   City  Gender             Email   Join Date
0   Aditya   24  Delhi    Male  aditya@gmail.com  15-01-2023
14   Kavya   21  Kochi  Female   kavya@gmail.com  30-03-2023
15   Kavya   21  Kochi  Female   kavya@gmail.com  30-03-2023
16  Aditya   24  Delhi    Male  aditya@gmail.com  15-01-2023

In [22]:
df3 = df2.drop_duplicates().copy()

In [24]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 0 to 14
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       2 non-null      object
 1   Age        2 non-null      int64
 2   City       2 non-null      object
 3   Gender     2 non-null      object
 4   Email      2 non-null      object
 5   Join Date  2 non-null      object
dtypes: int64(1), object(5)
memory usage: 112.0+ bytes

In [25]:
df3

      Name  Age   City  Gender             Email   Join Date
0   Aditya   24  Delhi    Male  aditya@gmail.com  15-01-2023
14   Kavya   21  Kochi  Female   kavya@gmail.com  30-03-2023

In [33]:
df2

      Name  Age   City  Gender             Email   Join Date Age Group canVote
0   Aditya   24  Delhi    Male  aditya@gmail.com  15-01-2023     Adult   Adult
14   Kavya   21  Kochi  Female   kavya@gmail.com  30-03-2023     Minor   Minor
15   Kavya   21  Kochi  Female   kavya@gmail.com  30-03-2023     Minor   Minor
16  Aditya   24  Delhi    Male  aditya@gmail.com  15-01-2023     Adult   Adult

In [36]:
df2["canVote"] = df2["Age"].apply(lambda x: "Adult" if x>=23 else "Minor")

In [37]:
df2

      Name  Age   City  Gender             Email   Join Date Age Group canVote
0   Aditya   24  Delhi    Male  aditya@gmail.com  15-01-2023     Adult   Adult
14   Kavya   21  Kochi  Female   kavya@gmail.com  30-03-2023     Minor   Minor
15   Kavya   21  Kochi  Female   kavya@gmail.com  30-03-2023     Minor   Minor
16  Aditya   24  Delhi    Male  aditya@gmail.com  15-01-2023     Adult   Adult

In [40]:
gender_map = {
    "Male": "M",
    "Female": "F",
    "NaN": "O"
}
df4 = df["Gender"].map(gender_map)

In [41]:
df4

0       M
1       M
2       F
3     NaN
4       M
5       F
6     NaN
7       M
8       F
9       M
10      F
11      M
12      F
13    NaN
14      F
15      F
16      M
Name: Gender, dtype: object